backend/app/models/review.rb

  def update_product_rating
    product.touch # This will update the updated_at timestamp
---
UPDATE `products` SET `products`.`updated_at` = '2025-08-01 13:44:48.559235' WHERE `products`.`id` = 21