backend/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (17, 18, 19, 20, 21)
---
  def authenticate_user
    header = request.headers['Authorization']
    return nil unless header

    token = header.split(' ').last
    return nil unless token

    begin
      decoded = JWT.decode(token, 'your-secret-key-here')[0]
      @current_user = User.find(decoded['user_id'])