backend/app/controllers/api/v1/auth_controller.rb

  def signup
    user = User.new(user_params)

    if user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `store_name`) VALUES ('Test User', 'test@example.com', '$2a$12$k5Dj6mX8K68KSawgvFsRauZTZ4.pKckWxnl9wpNBjxqM.zzgYi9yS', '2025-08-01 18:48:16.366313', '2025-08-01 18:48:16.366313', 'Test Store')

  def signin
    user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'admin@example.com' LIMIT 1