backend/app/controllers/api/v1/products_controller.rb

  def index
    @products = Product.includes(:user, :reviews).all
---
SELECT `products`.* FROM `products`
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` IN (61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80)
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (18, 19, 20, 17, 16)

  def show
    @product = Product.includes(:user, :reviews).find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1