backend/app/controllers/api/v1/reviews_controller.rb

  def index
    @reviews = Review.includes(:user).where(product_id: params[:product_id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (18, 19, 17)

  def create
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    @product = Product.find(params[:product_id])

    # Check if user has already reviewed this product
    existing_review = @product.reviews.find_by(user: @current_user)
    if existing_review
      render json: { error: 'You have already reviewed this product' }, status: :unprocessable_entity
      return
    end

    # Check if user has purchased this product (optional validation)
    # has_purchased = @current_user.orders.joins(:order_items)
    #                           .where(order_items: { product: @product })
    #                           .where.not(status: 'cancelled')
    #                           .exists?

    # unless has_purchased
    #   render json: { error: 'You can only review products you have purchased' }, status: :forbidden
    #   return
    # end

    @review = @product.reviews.build(review_params)
    @review.user = @current_user

    if @review.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 13 AND `reviews`.`user_id` = 17 LIMIT 1
INSERT INTO `reviews` (`rating`, `comment`, `user_id`, `product_id`, `created_at`, `updated_at`) VALUES (5, 'Great product! Highly recommended.', 17, 13, '2025-08-01 19:07:06.441365', '2025-08-01 19:07:06.441365')

  def user_reviews
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    @reviews = @current_user.reviews.includes(:product)
---
SELECT `products`.`id` FROM `products` WHERE `products`.`user_id` = 24
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 24

  def product_rating
    @product = Product.find(params[:product_id])
    average_rating = @product.reviews.average(:rating)&.round(1) || 0
    total_reviews = @product.reviews.count
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 13 LIMIT 1
SELECT AVG(`reviews`.`rating`) FROM `reviews` WHERE `reviews`.`product_id` = 13
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`product_id` = 13

  def rating_breakdown(product)
    breakdown = {}
    (1..5).each do |rating|
      count = product.reviews.where(rating: rating).count
---
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`product_id` = 13 AND `reviews`.`rating` = 1