backend/app/controllers/api/v1/wishlist_controller.rb

  def index
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    @wishlist_items = @current_user.wishlist_items.includes(:product)
---
SELECT `products`.`id` FROM `products` WHERE `products`.`user_id` = 24
SELECT `wishlist_items`.* FROM `wishlist_items` WHERE `wishlist_items`.`user_id` = 17

  def create
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    product_id = params[:product_id] || params.dig(:wishlist, :product_id)
    @product = Product.find(product_id)

    # Check if item is already in wishlist
    existing_item = @current_user.wishlist_items.find_by(product: @product)
    if existing_item
      render json: { error: 'Product is already in your wishlist' }, status: :unprocessable_entity
      return
    end

    @wishlist_item = @current_user.wishlist_items.build(product: @product)

    if @wishlist_item.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 18 LIMIT 1
SELECT `wishlist_items`.* FROM `wishlist_items` WHERE `wishlist_items`.`user_id` = 24 AND `wishlist_items`.`product_id` = 18 LIMIT 1
INSERT INTO `wishlist_items` (`user_id`, `product_id`, `created_at`, `updated_at`) VALUES (24, 18, '2025-08-01 20:06:06.100016', '2025-08-01 20:06:06.100016')

  def destroy
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    @wishlist_item = @current_user.wishlist_items.find_by(product_id: params[:id])

    if @wishlist_item
      @wishlist_item.destroy
---
SELECT `wishlist_items`.* FROM `wishlist_items` WHERE `wishlist_items`.`user_id` = 24 AND `wishlist_items`.`product_id` = 18 LIMIT 1
DELETE FROM `wishlist_items` WHERE `wishlist_items`.`id` = 2

  def check
    authenticate_user
    unless @current_user
      render json: { error: 'Authentication required' }, status: :unauthorized
      return
    end

    product_id = params[:product_id]
    is_in_wishlist = @current_user.wishlist_items.exists?(product_id: product_id)
---
SELECT 1 AS one FROM `wishlist_items` WHERE `wishlist_items`.`user_id` = 17 AND `wishlist_items`.`product_id` = 13 LIMIT 1